src/test/resources/requests/EM_RTR_Nowia.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>em</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">em=123</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns3:createTicketRequest xmlns="http://cio.att.com/commonheader/v3" xmlns:ns2="http://tktsvc.aots.att.com/ticket" xmlns:ns3="http://aots.att.com/ticket/v1" xmlns:ns4="http://cio.att.com/CommonHeader/v1">
            <WSHeader>
                <WSContext>
                    <FromAppId>EM</FromAppId>
                    <SourceIPAddress>aotsyjl.test.att.com</SourceIPAddress>
                </WSContext>
            </WSHeader>
            <ns3:createTicketInput>
                <ns2:RemoteAgentID>testsk7773</ns2:RemoteAgentID>
                <ns2:ClientTicketNum></ns2:ClientTicketNum>
                <ns2:FunctionalArea>GLOBAL_AM</ns2:FunctionalArea>
                <ns2:Log>
IP From: 
IP To: 
</ns2:Log>
                <ns2:ProblemAbstract>Test Create RTR from EM</ns2:ProblemAbstract>
                <ns2:ReptRequestType>Informational</ns2:ReptRequestType>
                <ns2:ReptSvcImpactFlag>No</ns2:ReptSvcImpactFlag>
                <ns2:Severity>5 - Normal</ns2:Severity>
                <ns2:TicketType>WEB</ns2:TicketType>
                <ns2:ReportedBy>NEENA JETHANI</ns2:ReportedBy>
                <ns2:ReportPhone>7324200703</ns2:ReportPhone>
                <ns2:TicketSource>EM</ns2:TicketSource>
                <ns2:TroubleReptDescText>Informational</ns2:TroubleReptDescText>
                <ns2:ReporterEmailAddr>nj5695@exo.att.com</ns2:ReporterEmailAddr>
                <ns2:AccountContactName>Laxmi</ns2:AccountContactName>
                <ns2:AccountPhone>6158800935</ns2:AccountPhone>
                <ns2:CustomerChronic>No</ns2:CustomerChronic>
                <ns2:LogUserID>testsk7773</ns2:LogUserID>
                <ns2:LogUserName>NEENA JETHANI</ns2:LogUserName>
                <ns2:LogUserPhone>7324200703</ns2:LogUserPhone>
                <ns2:PowerToCPE>Y</ns2:PowerToCPE>
                <ns2:TroubleReptCode>39</ns2:TroubleReptCode>
                <ns2:AccountContactEmail>hl096f@att.com</ns2:AccountContactEmail>
                <ns2:CompanyID>5mbbtcan</ns2:CompanyID>
                <ns2:ReporterEmailNotifyFlag>No</ns2:ReporterEmailNotifyFlag>
                <ns2:DispatchAuthorized>N</ns2:DispatchAuthorized>
                <ns2:SeverityClassification></ns2:SeverityClassification>
                <ns2:ContractType></ns2:ContractType>
                <ns2:UserID>EM_SAPrimary_Name_Phone_Email update ,EM_LCON_Name update </ns2:UserID>
                <ns2:ValidateContactInfo>Yes</ns2:ValidateContactInfo>
                <ns2:ValidateDispatchAuth>Yes</ns2:ValidateDispatchAuth>
                <ns2:ValidateLCONInfo>Yes</ns2:ValidateLCONInfo>
                <ns2:ValidateLocationAccessHours>Yes</ns2:ValidateLocationAccessHours>
                <ns2:ValidatePowerToCPE>Yes</ns2:ValidatePowerToCPE>
                <ns2:ValidateTestAuth>Yes</ns2:ValidateTestAuth>
                <ns2:ValidationResponsesRcvd>Yes</ns2:ValidationResponsesRcvd>
            </ns3:createTicketInput>
            <ns3:assetInput>
                <ns2:AssetID>USORT3MTNNJO5R</ns2:AssetID>
                <ns2:ClientName>BVOIP Company D_Test</ns2:ClientName>
                <ns2:CircuitID>USORT3MTNNJO5R</ns2:CircuitID>
                <ns2:CountryCode>USA</ns2:CountryCode>
                <ns2:CallbackContact>Laxmi H Pluemacher</ns2:CallbackContact>
                <ns2:CallbackPhone></ns2:CallbackPhone>
                <ns2:BvoipIndicator>Yes</ns2:BvoipIndicator>
                <ns2:BvoipCity>MIDDLETOWN</ns2:BvoipCity>
                <ns2:BvoipStateProvince>NJ</ns2:BvoipStateProvince>
                <ns2:BvoipZipPostal>07748</ns2:BvoipZipPostal>
                <ns2:BvoipCountryCode>USA</ns2:BvoipCountryCode>
                <ns2:AgencyID></ns2:AgencyID>
                <ns2:AgencyName>BVOIP Company D_Test</ns2:AgencyName>
                <ns2:LocationDetailsInfoList>
                    <ns2:LocationDetailsInfo>
                        <ns2:LocationContactName>Laxmi H Pluemacher</ns2:LocationContactName>
                        <ns2:LocationContactPhone>7324208433</ns2:LocationContactPhone>
                        <ns2:LocationContactEmail>cpluemacher@att.com</ns2:LocationContactEmail>
                        <ns2:PremiseAccessHoursInfoList>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>MON</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>TUE</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>WED</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>THU</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>FRI</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>SAT</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                            <ns2:AccessHoursInfo>
                                <ns2:DayOfWeek>SUN</ns2:DayOfWeek>
                                <ns2:Start>08:00</ns2:Start>
                                <ns2:End>17:00</ns2:End>
                            </ns2:AccessHoursInfo>
                        </ns2:PremiseAccessHoursInfoList>
                        <ns2:LocationDetailsType>L</ns2:LocationDetailsType>
                    </ns2:LocationDetailsInfo>
                </ns2:LocationDetailsInfoList>
                <ns2:BvoipProbeIndicator>N</ns2:BvoipProbeIndicator>
                <ns2:GDBAssetObjectID>84775047</ns2:GDBAssetObjectID>
                <ns2:GDBContactObjectID>0</ns2:GDBContactObjectID>
                <ns2:GDBOrgObjectID>0</ns2:GDBOrgObjectID>
                <ns2:ResellerIndicator>N</ns2:ResellerIndicator>
            </ns3:assetInput>
            <ns3:createControlInput>
                <ns2:AssetLookupType>BVOIP_RTR</ns2:AssetLookupType>
                <ns2:CreateType>U</ns2:CreateType>
                <ns2:RetrieveAssetInfo>R</ns2:RetrieveAssetInfo>
            </ns3:createControlInput>
        </ns3:createTicketRequest>
    </soap:Body>
</soap:Envelope>